## Moodle database schema understanding and Data Extraction Transformation and Loading (ETL)

#### Libraries

In [100]:
import pandas as pd
from pandas.api.types import is_string_dtype, is_numeric_dtype
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
plt.style.use("ggplot")
%load_ext sql
import psycopg2
from sqlalchemy import create_engine

In [26]:
## Connection
%sql postgresql://postgres:password@localhost/moodle

## Moodle database schema understanding

#### Number of tables

In [29]:
%sql SELECT COUNT(*) FROM information_schema.tables;

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(642,)]

#### Number of records in each of the tables given in the MIT section

In [47]:
mit = ["mdl_logstore_standard_log","mdl_context",
"mdl_user","mdl_course","mdl_modules","mdl_course_modules",
"mdl_course_modules_completion","mdl_grade_items","mdl_grade_grades",
"mdl_grade_categories","mdl_grade_items_history",
"mdl_grade_grades_history","mdl_grade_categories_history",
"mdl_forum","mdl_forum_discussions","mdl_forum_posts"]

for table in mit:
    count = %sql SELECT COUNT(*) FROM {table};
    print(table,count)

 * postgresql://postgres:***@localhost/moodle
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_logstore_standard_log +--------+
| count  |
+--------+
| 417554 |
+--------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_context +-------+
| count |
+-------+
|  4359 |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_user +-------+
| count |
+-------+
|  1052 |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_course +-------+
| count |
+-------+
|   15  |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_modules +-------+
| count |
+-------+
|   26  |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_course_modules +-------+
| count |
+-------+
|  290  |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_course_modules_completion +-------+
| count |
+-------+
|  4483 |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_grade_items +-------+
| count |
+-------+
|  113  |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_grade_grades +-------+
| count |
+-------+
|  3643 |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_grade_categories +-------+
| count |
+-------+
|   16  |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_grade_items_history +-------+
| count |
+-------+
|  486  |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_grade_grades_history +-------+
| count |
+-------+
|  7108 |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_grade_categories_history +-------+
| count |
+-------+
|   46  |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_forum +-------+
| count |
+-------+
|   34  |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_forum_discussions +-------+
| count |
+-------+
|   23  |
+-------+
 * postgresql://postgres:***@localhost/moodle
1 rows affected.
mdl_forum_posts +-------+
| count |
+-------+
|  131  |
+-------+

#### Number of quiz submissions by hour of day

In [92]:
%%sql
SELECT COUNT(id) AS Submissions, EXTRACT(HOUR FROM to_timestamp(timecreated)) AS hour
FROM mdl_logstore_standard_log
WHERE action='submitted' AND component='mod_quiz'
GROUP BY EXTRACT(HOUR FROM to_timestamp(timecreated));

 * postgresql://postgres:***@localhost/moodle
24 rows affected.

[(29, 0.0),
 (7, 1.0),
 (14, 2.0),
 (10, 3.0),
 (18, 4.0),
 (17, 5.0),
 (34, 6.0),
 (46, 7.0),
 (69, 8.0),
 (95, 9.0),
 (88, 10.0),
 (104, 11.0),
 (90, 12.0),
 (80, 13.0),
 (68, 14.0),
 (68, 15.0),
 (70, 16.0),
 (57, 17.0),
 (55, 18.0),
 (46, 19.0),
 (53, 20.0),
 (26, 21.0),
 (23, 22.0),
 (30, 23.0)]

#### Monthly usage time of learners who have confirmed and are not deleted

In [83]:
## The table
%sql SELECT * FROM mdl_user LIMIT 5;

 * postgresql://postgres:***@localhost/moodle
5 rows affected.

[(1, 1, 0, 0, 0, '', 'Germany', 'en', 0, 0, 0, 0, '', 'Male', 'DE'),
 (20, 1, 0, 0, 0, '', 'Germany', 'en', 1549745767, 1562935333, 1549745767, 1562935333, '197.215.32.111', 'Male', 'DE'),
 (15, 1, 0, 0, 0, '', 'Germany', 'en', 1549633236, 1563537002, 1563469481, 1563537002, '41.184.239.200', 'Male', 'DE'),
 (36, 1, 0, 0, 0, '', 'Ghana', 'en', 1549641288, 1559227964, 1549651186, 1559227892, '154.160.1.224', 'Male', 'GH'),
 (44, 1, 0, 0, 0, '', 'Ghana', 'en', 1549637001, 1560095090, 1557475553, 1560094908, '129.122.1.14', 'Male', 'GH')]

In [93]:
%%sql
SELECT COUNT(lastaccess - firstaccess) AS usage_time,
EXTRACT(month FROM to_timestamp(firstaccess)) AS months
FROM mdl_user 
WHERE confirmed = 1 AND deleted = 0
GROUP BY months
ORDER BY usage_time DESC;

 * postgresql://postgres:***@localhost/moodle
7 rows affected.

[(450, 1.0),
 (227, 2.0),
 (140, 4.0),
 (111, 5.0),
 (58, 3.0),
 (31, 7.0),
 (27, 6.0)]

#### Count of log events per user for the following verbs: ['loggedin', 'viewed', 'started', ,'submitted', 'uploaded', 'updated', 'searched', 'resumed', 'answered', 'attempted', 'abandoned']

In [94]:
%%sql 
SELECT userid, COUNT(action) AS log_events
FROM mdl_logstore_standard_log 
WHERE action IN ('loggedin', 'viewed', 'started','submitted',
                  'uploaded', 'updated', 'searched', 'resumed',
                  'answered', 'attempted', 'abandoned')
GROUP BY userid
ORDER BY log_events
DESC LIMIT 10;

 * postgresql://postgres:***@localhost/moodle
10 rows affected.

[(0, 5954),
 (3, 5644),
 (2, 5273),
 (246, 2718),
 (917, 2477),
 (45, 2274),
 (165, 2085),
 (347, 2019),
 (290, 1856),
 (344, 1796)]

#### Python class to pull Overall grade of learners and Number of forum posts

In [130]:
class Grades_Forums():
    
    def __init__(self, user:str, db:str, password:str):

        self.user = user
        self.db = db
        self.password = password
        
        self.open_local_db()
        
    def open_local_db(self):
            
        try:
            self.connection = psycopg2.connect(user = self.user,
                                            database = self.db,
                                            password = self.password,
                                            host = "127.0.0.1",
                                            port = "5432")

            # perform autocommit on queries
            self.connection.set_session(autocommit=True)
            self.cursor = self.connection.cursor() 
        
            # Print PostgreSQL version
            self.cursor.execute("SELECT version();")
            self.record = self.cursor.fetchone()
            print("You are connected to - ", self.record,"\n")
    
        except (Exception, psycopg2.Error) as error :
            print(f"Error while connecting to PostgreSQL {error}")
        return self
    
    def overall_grades(self):
        
        result = pd.read_sql("SELECT SUM(finalgrade) AS overall_grades \
                             FROM mdl_grade_grades",
                            self.connection)
        
        return result
        
    def forum_posts(self):
        
        result = pd.read_sql("SELECT COUNT(id) AS forum_count \
                            FROM mdl_forum_posts;", 
                            self.connection)
        
        return result
    
    def close(self):
        print("--- session ended ---")
        return self.connection.close()

In [131]:
tryout = Grades_Forums(user="postgres", db="moodle", password="password")

You are connected to -  ('PostgreSQL 12.4, compiled by Visual C++ build 1914, 64-bit',)

In [132]:
tryout.overall_grades()

   overall_grades
0    231922.91029

In [133]:
tryout.forum_posts()

   forum_count
0          131

In [134]:
tryout.close()

--- session ended ---

## Data Extraction Transformation and Loading (ETL

A python class to perform the following:
1. Compute dedication time (see note below)
2. Compute login and activity counts.
3. Based on the following metrics, group students as top 1%, 5%, 10%, 25%
 - Login count
 - Activity count
 - Dedication time

In [180]:
class ETL():
    
    def __init__(self, user:str, db:str, password:str):

        self.user = user
        self.db = db
        self.password = password
        
        self.open_local_db()
        
    def open_local_db(self):
            
        try:
            self.connection = psycopg2.connect(user = self.user,
                                            database = self.db,
                                            password = self.password,
                                            host = "127.0.0.1",
                                            port = "5432")

            # perform autocommit on queries
            self.connection.set_session(autocommit=True)
            self.cursor = self.connection.cursor() 
        
            # Print PostgreSQL version
            self.cursor.execute("SELECT version();")
            self.record = self.cursor.fetchone()
            print("You are connected to - ", self.record,"\n")
    
        except (Exception, psycopg2.Error) as error :
            print(f"Error while connecting to PostgreSQL {error}")
        return self
    
    def dedication_time(self):
        
        result = pd.read_sql("",
                            self.connection)
        
        return result
        
    def login_count(self):
        
        result = pd.read_sql("SELECT userid, COUNT(action) AS login_count \
                            FROM mdl_logstore_standard_log \
                            WHERE action = 'loggedin' \
                            GROUP BY userid \
                            ORDER BY login_count \
                            DESC;", 
                            self.connection)
        
        return result
    
    def activity_count(self):

        result = pd.read_sql("SELECT userid, COUNT(action) AS activity_count \
                            FROM mdl_logstore_standard_log \
                            GROUP BY userid \
                            ORDER BY activity_count \
                            DESC;", 
                            self.connection)

        return result
    
    def top_perc(self,count,perc):

        if count == "login":
            metric = self.login_count()
        elif count == "activity":
            metric = self.activity_count()
        else:
            metric = self.dedication_time()
        if perc == 1:
            result = metric[:((len(metric)*1)//100)]
        elif perc == 5:
            result = metric[:((len(metric)*5)//100)]
        elif perc == 10:
            result = metric[:((len(metric)*10)//100)]
        else:
            result = metric[:((len(metric)*25)//100)]

        return result
    
    def close(self):
        print("--- session ended ---")
        return self.connection.close()

In [181]:
ex = ETL(user="postgres", db="moodle", password="mania13")

You are connected to -  ('PostgreSQL 12.4, compiled by Visual C++ build 1914, 64-bit',)

In [186]:
ex.top_perc(count="login",perc=5)

    userid  login_count
0        2          169
1      246          113
2        3          107
3      369          100
4      165           91
5      290           73
6      344           68
7      266           64
8       45           63
9       90           57
10     170           55
11       5           54
12     581           51
13     190           50
14     917           47
15      25           46
16     277           46
17     383           42
18      57           41
19     362           40
20     409           38
21     607           37
22      95           37
23     259           36
24     586           36
25     286           33
26      50           33
27      48           32
28     294           31
29     284           30

In [185]:
ex.top_perc(count="activity",perc=25)

     userid  activity_count
0         2           45023
1       246           13917
2         3           12922
3       917           10696
4       581           10533
..      ...             ...
257     683             130
258     106             128
259      71             128
260     151             126
261     219             126

[262 rows x 2 columns]